/*
 Navicat MySQL Data Transfer

 Source Server         : mysql
 Source Server Version : 50713
 Source Host           : localhost
 Source Database       : nodejs

 Target Server Version : 50713
 File Encoding         : utf-8

 Date: 04/10/2017 17:15:06 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `project`
-- ----------------------------
DROP TABLE IF EXISTS `project`;
CREATE TABLE `project` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `project` text NOT NULL,
  `project_name` text CHARACTER SET utf8 NOT NULL,
  `manager` text CHARACTER SET utf8 NOT NULL,
  `manager_2` text CHARACTER SET utf8,
  `finished` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=latin1;

-- ----------------------------
--  Records of `project`
-- ----------------------------
BEGIN;
INSERT INTO `project` VALUES ('1', '2017DK01', '大功率短波岸站', '骆曹飞', null, '0'), ('2', '2017DK02', '舵轮驱动器', '徐峰', null, '0'), ('3', '2017DK03', '二代主机遥控系统', '吴富民', null, '0'), ('4', '2017DK04', '基于二代核心板的VDES和NAVDAT的OFDM技术研究', '陈亮', null, '0'), ('5', '2017DK05', '交互式虚拟船舶展示系统', '徐永刚', null, '0'), ('6', '2017DK06', '雷达应答器', '于海鹏', null, '0'), ('7', '2017DK07', '渔船监管大数据平台', '徐斌', null, '0'), ('8', '2017DK08', '自适应选频遥控电台', '周建英', '王兵', '0'), ('9', '2017DK09', 'GPS 电浮标和收发机', '万德松', '刘江南', '0'), ('10', '2017DK10', '北斗示位标', '姚克波', '陈建林', '0'), ('11', '2017DK11', '北斗渔船监管系统', '姚克波', '陈建林', '0'), ('12', '2017DK12', '高速通信卫星技术研究', '罗新林', null, '0'), ('13', '2015DK11', '智能船舶控制系统', '王小春', null, '0'), ('14', '2017DM01', '便携式天线阵', '张群峰', null, '0'), ('15', 'DK008', '渔船自动舵', '徐峰', null, '0'), ('16', 'DK019', '波浪艇', '木建一', null, '0'), ('17', 'DK020', '温流场空间结构水声监测技术', '朱坤', null, '0'), ('18', '2015DK04', 'NBDP', '周建英', null, '0'), ('19', '2015DK10', '遥控电台', '骆曹飞', null, '0'), ('20', '2016DK04', '舵角指示系统', '徐峰', null, '0');
COMMIT;

-- ----------------------------
--  Table structure for `user`
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(20) NOT NULL AUTO_INCREMENT,
  `username` text CHARACTER SET utf8 NOT NULL,
  `password` varchar(255) CHARACTER SET utf8 NOT NULL DEFAULT '12345',
  `create_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=latin1;

-- ----------------------------
--  Records of `user`
-- ----------------------------
BEGIN;
INSERT INTO `user` VALUES ('1', '裘鸿', '881016', '2017-04-10 08:09:14'), ('2', '李培正', '12345', '2017-04-10 08:09:32'), ('3', '刘江南', '12345', '2017-04-10 08:10:14'), ('4', '木建一', '12345', '2017-04-10 08:10:20'), ('5', '王小春', '12345', '2017-04-10 08:10:25'), ('6', '王勇', '12345', '2017-04-10 08:10:31'), ('7', '陈海民', '12345', '2017-04-10 08:10:51'), ('9', '王兵', '12345', '2017-04-10 08:11:18'), ('10', '徐永刚', '12345', '2017-04-10 08:11:24'), ('11', '徐峰', '12345', '2017-04-10 08:11:29'), ('12', '姚克波', '12345', '2017-04-10 08:11:39'), ('13', '张群峰', '12345', '2017-04-10 08:11:44'), ('14', '朱坤', '12345', '2017-04-10 08:11:49'), ('15', '周建英', '12345', '2017-04-10 08:11:54'), ('16', '陈建林', '12345', '2017-04-10 08:12:03'), ('17', '陈亮', '12345', '2017-04-10 08:12:10'), ('18', '罗新林', '12345', '2017-04-10 08:12:17'), ('19', '骆曹飞', '12345', '2017-04-10 08:12:20'), ('20', '万德松', '12345', '2017-04-10 08:12:32'), ('21', '吴富民', '12345', '2017-04-10 08:12:49'), ('22', '徐斌', '12345', '2017-04-10 08:12:58'), ('23', '于海鹏', '12345', '2017-04-10 08:13:09');
COMMIT;

-- ----------------------------
--  Table structure for `week_reports`
-- ----------------------------
DROP TABLE IF EXISTS `week_reports`;
CREATE TABLE `week_reports` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `project` text CHARACTER SET utf8 NOT NULL,
  `submitter` text CHARACTER SET utf8 NOT NULL,
  `add_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `importance` text CHARACTER SET utf8,
  `completed` text CHARACTER SET utf8,
  `issures` text CHARACTER SET utf8,
  `plan` text CHARACTER SET utf8,
  `create_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=88 DEFAULT CHARSET=latin1;

-- ----------------------------
--  Records of `week_reports`
-- ----------------------------
BEGIN;
INSERT INTO `week_reports` VALUES ('10', '17171717', '胡延误', '2017-04-06 09:06:20', '如何折腾一个上了年纪还不服老的小龙人', '有点懒/不太乖/爱捣蛋/很安静/很冷漠/很放肆/又霸道/然后爱哈哈大笑/', '没有看见星星 没有喝到牛奶 没有吃到傻子做的饭 无穷无尽的假期还是匆匆跑完', '乖乖吃饭 好好撩妹', '2017-04-10 10:45:29'), ('44', '1231', '213', '2017-04-06 11:29:50', '', '', '', '', '2017-04-10 10:45:29'), ('45', '1231', '213', '2017-04-06 11:29:53', '', '', '', '', '2017-04-10 10:45:29'), ('46', '1231', '213', '2017-04-06 11:29:53', '', '', '', '', '2017-04-10 10:45:29'), ('49', '1231', '213', '2017-04-06 11:29:55', '123', '123', '123', '1233131231', '2017-04-10 10:45:29'), ('61', 'dk0061', '骆曹12311', '2017-04-06 13:35:00', '1/时代阿斯顿阿斯顿 \n23/／阿斯顿阿斯顿啊说\n23/a时代阿斯顿', '1、123123\n2、第二点事情', '存在的问题有：\n1/是的', '下周重点关注', '2017-04-10 10:45:29'), ('65', '2017dk01', '骆曹飞', '2017-04-06 16:12:56', '1、123\n2、什么什么\n3、撒撒撒', '1、实打实大', '2、撒打算的', '3、撒大的', '2017-04-10 10:45:29'), ('66', 'dk01', '张三', '2017-04-06 16:16:14', '阿斯顿', '', '', '', '2017-04-10 10:45:29'), ('67', 'dk02', '李四', '2017-04-06 16:16:27', '阿斯顿', '', '', '', '2017-04-10 10:45:29'), ('80', '1', '姚克波', '2017-04-10 08:16:38', '1', '1', '1', '1', '2017-04-10 10:45:29'), ('81', '2', '姚克波', '2017-04-10 08:16:44', '1', '1', '1', '1', '2017-04-10 10:45:29'), ('82', '1231123', '骆曹飞', '2017-04-10 10:44:27', '1123', '3', '4', '5', '2017-04-10 10:45:29'), ('84', '123', '骆曹飞', '2017-04-10 14:24:30', '1', '', '', '', '2017-04-10 14:24:30'), ('86', '11111', '骆曹飞', '2017-04-10 16:19:34', '1', '', '', '', '2017-04-10 16:19:34'), ('87', '1', '裘鸿', '2017-04-10 16:50:47', '', '', '', '', '2017-04-10 16:50:47');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
