/*
 Navicat MySQL Data Transfer

 Source Server         : mysql
 Source Server Version : 50713
 Source Host           : localhost
 Source Database       : nodejs

 Target Server Version : 50713
 File Encoding         : utf-8

 Date: 04/13/2017 16:46:32 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `contract_number`
-- ----------------------------
DROP TABLE IF EXISTS `contract_number`;
CREATE TABLE `contract_number` (
  `id` int(4) unsigned zerofill NOT NULL AUTO_INCREMENT,
  `submitter` text CHARACTER SET utf8 NOT NULL,
  `contract_number` text CHARACTER SET utf8 NOT NULL,
  `contract_name` text CHARACTER SET utf8 NOT NULL,
  `company` text CHARACTER SET utf8 NOT NULL,
  `money` text CHARACTER SET utf8 NOT NULL,
  `create_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `sign_date` text CHARACTER SET utf8 NOT NULL,
  `begin_date` text CHARACTER SET utf8 NOT NULL,
  `end_date` text CHARACTER SET utf8 NOT NULL,
  `year` text CHARACTER SET utf8,
  `ForS` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=latin1;

-- ----------------------------
--  Records of `contract_number`
-- ----------------------------
BEGIN;
INSERT INTO `contract_number` VALUES ('1', '熊强', 'HDYFF170001', '委托检测合同', '中国电子科技集团公司第二十一研究所', '3000', '2017-04-13 10:44:00', '2017-01-17', '2017-01-17', '2017-02-22', '2017', 'F'), ('2', '王小春', 'HDYFF170002', '审图服务协议', '中国船级社上海分社国内船舶审图部', '159872', '2017-04-13 10:46:25', '2017-01-11', '2017-01-11', '2017-01-31', '2017', 'F'), ('3', '骆曹飞', 'HDYFF170003', '技术开发合同', '重庆天地栅格信息技术有限公司', '60000', '2017-04-13 10:47:20', '2017-02-23', '2017-02-23', '2017-03-31', '2017', 'F'), ('4', '黄毫军', 'HDYFF170004', '技术服务合同', '上海灵钥机械设计有限公司', '25000', '2017-04-13 10:48:11', '2017-03-02', '2017-03-02', '2017-04-02', '2017', 'F'), ('5', '王小春', 'HDYFF170005', '海电院智能试验船开发设计合同', '嘉兴市金航船舶设计有限公司', '300000', '2017-04-13 10:48:55', '2017-01-19', '2017-04-13', '2017-04-13', '2017', 'F'), ('6', '骆曹飞', 'HDYFF170006', '技术开发合同', '南京埃尔弗电子科技有限公司', '280000', '2017-04-13 10:49:48', '2017-03-10', '2017-03-10', '2017-12-31', '2017', 'F'), ('7', '刘江南', 'HDYFF170007', '委托检测合同', '国家无线电监测中心检测中心', '15000', '2017-04-13 10:50:32', '2017-03-13', '2017-03-13', '2017-03-13', '2017', 'F'), ('8', '黄毫军', 'HDYFF170008', '技术开发合同', '上海涟恒精密机械有限公司', '40000', '2017-04-13 10:51:00', '2017-04-13', '2017-04-13', '2017-04-13', '2017', 'F'), ('9', '王小春', 'HDYFS170001', '试验船航控系统技术开发合同', '南京长峰航天电子科技有限公司', '380000', '2017-04-13 13:46:03', '2017-01-03', '2017-01-03', '2017-06-30', '2017', 'S');
COMMIT;

-- ----------------------------
--  Table structure for `project`
-- ----------------------------
DROP TABLE IF EXISTS `project`;
CREATE TABLE `project` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `project` text NOT NULL,
  `project_name` text CHARACTER SET utf8 NOT NULL,
  `manager` text CHARACTER SET utf8 NOT NULL,
  `manager_2` text CHARACTER SET utf8,
  `finished` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=latin1;

-- ----------------------------
--  Records of `project`
-- ----------------------------
BEGIN;
INSERT INTO `project` VALUES ('1', '2017DK01', '大功率短波岸站', '骆曹飞', null, '0'), ('2', '2017DK02', '舵轮驱动器', '徐峰', null, '0'), ('3', '2017DK03', '二代主机遥控系统', '吴富民', null, '0'), ('4', '2017DK04', '基于二代核心板的VDES和NAVDAT的OFDM技术研究', '陈亮', null, '0'), ('5', '2017DK05', '交互式虚拟船舶展示系统', '徐永刚', null, '0'), ('6', '2017DK06', '雷达应答器', '于海鹏', null, '0'), ('7', '2017DK07', '渔船监管大数据平台', '徐斌', null, '0'), ('8', '2017DK08', '自适应选频遥控电台', '周建英', '王兵', '0'), ('9', '2017DK09', 'GPS 电浮标和收发机', '万德松', '刘江南', '0'), ('10', '2017DK10', '北斗示位标', '姚克波', '陈建林', '0'), ('11', '2017DK11', '北斗渔船监管系统', '姚克波', '陈建林', '0'), ('12', '2017DK12', '高速通信卫星技术研究', '罗新林', null, '0'), ('13', '2015DK11', '智能船舶控制系统', '王小春', null, '0'), ('14', '2017DM01', '便携式天线阵', '张群峰', null, '0'), ('15', 'DK008', '渔船自动舵', '徐峰', null, '0'), ('16', 'DK019', '波浪艇', '木建一', null, '0'), ('17', 'DK020', '温流场空间结构水声监测技术', '朱坤', null, '0'), ('18', '2015DK04', 'NBDP', '周建英', null, '0'), ('19', '2015DK10', '遥控电台', '骆曹飞', null, '0'), ('20', '2016DK04', '舵角指示系统', '徐峰', null, '0');
COMMIT;

-- ----------------------------
--  Table structure for `user`
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(20) NOT NULL AUTO_INCREMENT,
  `username` text CHARACTER SET utf8 NOT NULL,
  `password` varchar(255) CHARACTER SET utf8 NOT NULL DEFAULT '12345',
  `create_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `permission` int(11) NOT NULL DEFAULT '4',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=52 DEFAULT CHARSET=latin1;

-- ----------------------------
--  Records of `user`
-- ----------------------------
BEGIN;
INSERT INTO `user` VALUES ('1', '裘鸿', '881016', '2017-04-10 08:09:14', '0'), ('2', '李培正', '12345', '2017-04-10 08:09:32', '1'), ('3', '刘江南', '12345', '2017-04-10 08:10:14', '3'), ('4', '木建一', '12345', '2017-04-10 08:10:20', '3'), ('5', '王小春', '12345', '2017-04-10 08:10:25', '2'), ('6', '王勇', '12345', '2017-04-10 08:10:31', '2'), ('7', '陈海民', '12345', '2017-04-10 08:10:51', '2'), ('9', '王兵', '12345', '2017-04-10 08:11:18', '3'), ('10', '徐永刚', '12345', '2017-04-10 08:11:24', '3'), ('11', '徐峰', '12345', '2017-04-10 08:11:29', '3'), ('12', '姚克波', '12345', '2017-04-10 08:11:39', '2'), ('13', '张群峰', '12345', '2017-04-10 08:11:44', '3'), ('14', '朱坤', '12345', '2017-04-10 08:11:49', '3'), ('15', '周建英', '12345', '2017-04-10 08:11:54', '3'), ('16', '陈建林', '12345', '2017-04-10 08:12:03', '3'), ('17', '陈亮', '12345', '2017-04-10 08:12:10', '3'), ('18', '罗新林', '12345', '2017-04-10 08:12:17', '2'), ('19', '骆曹飞', '12345', '2017-04-10 08:12:20', '2'), ('20', '万德松', '12345', '2017-04-10 08:12:32', '3'), ('21', '吴富民', '12345', '2017-04-10 08:12:49', '2'), ('22', '徐斌', '12345', '2017-04-10 08:12:58', '2'), ('23', '于海鹏', '12345', '2017-04-10 08:13:09', '3'), ('24', '刘银泉', '12345', '2017-04-13 13:13:19', '4'), ('25', '富凌峰', '12345', '2017-04-13 13:13:28', '4'), ('26', '张寅昊', '12345', '2017-04-13 13:13:58', '4'), ('27', '王旭', '12345', '2017-04-13 13:14:13', '4'), ('28', '梁文燕', '12345', '2017-04-13 13:14:33', '4'), ('29', '毛欢云', '12345', '2017-04-13 13:14:43', '4'), ('30', '张珊波', '12345', '2017-04-13 13:14:58', '4'), ('31', '陈凯明', '12345', '2017-04-13 13:15:17', '4'), ('32', '倪磊', '12345', '2017-04-13 13:15:36', '4'), ('33', '王志刚', '12345', '2017-04-13 13:15:46', '4'), ('34', '吴林威', '12345', '2017-04-13 13:15:52', '4'), ('35', '肖君辉', '12345', '2017-04-13 13:16:04', '4'), ('36', '孔繁翔', '12345', '2017-04-13 13:16:25', '4'), ('37', '郑子元', '12345', '2017-04-13 13:16:41', '3'), ('38', '熊强', '12345', '2017-04-13 13:16:55', '4'), ('39', '杨世涛', '12345', '2017-04-13 13:17:05', '4'), ('40', '梁炯炯', '12345', '2017-04-13 13:17:10', '4'), ('41', '李炜', '12345', '2017-04-13 13:17:15', '4'), ('42', '王炜皋', '12345', '2017-04-13 13:17:20', '4'), ('43', '马晓刚', '12345', '2017-04-13 13:17:30', '4'), ('44', '汤明超', '12345', '2017-04-13 13:17:42', '4'), ('45', '徐浩', '12345', '2017-04-13 13:17:49', '4'), ('46', '王贝贝', '12345', '2017-04-13 13:17:56', '4'), ('47', '王凌峰', '12345', '2017-04-13 13:18:12', '4'), ('48', '朱俊峰', '12345', '2017-04-13 13:18:24', '4'), ('49', '何泽骅', '12345', '2017-04-13 13:18:51', '4'), ('50', '李攀', '12345', '2017-04-13 13:19:00', '4'), ('51', '刘洋', '12345', '2017-04-13 13:19:08', '4');
COMMIT;

-- ----------------------------
--  Table structure for `week_reports`
-- ----------------------------
DROP TABLE IF EXISTS `week_reports`;
CREATE TABLE `week_reports` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `project` text CHARACTER SET utf8 NOT NULL,
  `submitter` text CHARACTER SET utf8 NOT NULL,
  `add_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `importance` text CHARACTER SET utf8,
  `completed` text CHARACTER SET utf8,
  `issures` text CHARACTER SET utf8,
  `plan` text CHARACTER SET utf8,
  `create_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=91 DEFAULT CHARSET=latin1;

-- ----------------------------
--  Records of `week_reports`
-- ----------------------------
BEGIN;
INSERT INTO `week_reports` VALUES ('10', '17171717', '胡延误', '2017-04-06 09:06:20', '如何折腾一个上了年纪还不服老的小龙人', '有点懒/不太乖/爱捣蛋/很安静/很冷漠/很放肆/又霸道/然后爱哈哈大笑/', '没有看见星星 没有喝到牛奶 没有吃到傻子做的饭 无穷无尽的假期还是匆匆跑完', '乖乖吃饭 好好撩妹', '2017-04-10 10:45:29'), ('44', '1231', '213', '2017-04-06 11:29:50', '', '', '', '', '2017-04-10 10:45:29'), ('45', '1231', '213', '2017-04-06 11:29:53', '', '', '', '', '2017-04-10 10:45:29'), ('46', '1231', '213', '2017-04-06 11:29:53', '', '', '', '', '2017-04-10 10:45:29'), ('49', '1231', '213', '2017-04-06 11:29:55', '123', '123', '123', '1233131231', '2017-04-10 10:45:29'), ('66', 'dk01', '张三', '2017-04-06 16:16:14', '阿斯顿', '', '', '', '2017-04-10 10:45:29'), ('81', '2', '姚克波', '2017-04-10 08:16:44', '1', '1', '1', '1', '2017-04-10 10:45:29'), ('82', '12', '骆曹飞', '2017-04-11 16:16:56', '1123', '3', '4', '5', '2017-04-10 10:45:29'), ('88', '一231', '裘鸿', '2017-04-12 08:05:17', '11', '', '', '', '2017-04-10 20:02:22'), ('89', '1', '裘鸿', '2017-04-13 15:15:57', '1', '1', '1', '1', '2017-04-13 15:15:57'), ('90', '1as das das asd asd as ', '裘鸿', '2017-04-13 15:16:41', '1', '1', '', '', '2017-04-13 15:16:41');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
